app/views/presentations/index.html.haml

SELECT "projects".* FROM "projects" WHERE "projects"."engineer_id" IN (1, 2)
---
      %section
        - engineer.projects.each do |project|