app/controllers/engineers_controller.rb

SELECT `engineers`.* FROM `engineers` ORDER BY name
---
	def index
	  @engineers = Engineer.order(:name)

INSERT INTO "engineers" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 05 Nov 2012 06:17:10 UTC +00:00], ["name", "Joseph Jorgense"], ["updated_at", Mon, 05 Nov 2012 06:17:10 UTC +00:00]]
---
	def create
	  if @engineer = Engineer.create(params[:engineer])

SELECT "engineers".* FROM "engineers" WHERE "engineers"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
	  @engineer = Engineer.find(params[:id])

SELECT "engineers".* FROM "engineers" WHERE "engineers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "engineers" SET "name" = 'Joseph Jorgensen', "updated_at" = '2012-11-05 06:19:56.329718' WHERE "engineers"."id" = 1
---
	def update
	  @engineer = Engineer.find(params[:id])
	  if @engineer.update_attributes(params[:engineer])

SELECT "engineers".* FROM "engineers" WHERE "engineers"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "engineers" WHERE "engineers"."id" = ?  [["id", 3]]
---
	def destroy
	  @engineer = Engineer.find(params[:id])
      @engineer.destroy