app/controllers/presentations_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."engineer_id" IN (1, 2)
SELECT `engineers`.* FROM `engineers`
---
  def index
  	@engineers = Engineer.includes(:projects)