app/controllers/projects_controller.rb

  def create
    if @project = @engineer.projects.create(params[:project])
---
INSERT INTO "projects" ("created_at", "description", "person_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 05 Nov 2012 04:02:39 UTC +00:00], ["description", "<p>\r\n\ttitile</p>\r\n"], ["person_id", 1], ["title", "titie"], ["updated_at", Mon, 05 Nov 2012 04:02:39 UTC +00:00]]

  def update
    @project = @engineer.projects.find(params[:id])
    if @project.update_attributes(params[:project])
---
SELECT "projects".* FROM "projects" WHERE "projects"."engineer_id" = 1 AND "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE `projects` SET `description` = '<p>\r\n	project 1</p>\r\n<p>\r\n	<img alt=\"\" src=\"http://www.dam7.com/Images/Sunsets/images/myspace-sunset-images-dam7-0012.jpg\" /></p>\r\n', `updated_at` = '2012-11-08 11:53:02' WHERE `projects`.`id` = 1

  def edit
    @project = @engineer.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."engineer_id" = 1 AND "projects"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @project = @engineer.projects.find(params[:id])
    @project.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."engineer_id" = 1 AND "projects"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 5]]